# 10주차 
#### 판다스2

In [2]:
import pandas as pd

list1=list([['Han_bit', 'Man', '20', '180'],
            ['Han_la', 'Man', '21', '117'],
            ['Ha_na', 'Woman', '20', '160']
           ])
col_names=['name','sex','age','height']
df=pd.DataFrame(list1, columns=col_names)
df

      name    sex age height
0  Han_bit    Man  20    180
1   Han_la    Man  21    117
2    Ha_na  Woman  20    160

In [3]:
df.sort_index(axis=0) #열 기준 오름차순 정렬

      name    sex age height
0  Han_bit    Man  20    180
1   Han_la    Man  21    117
2    Ha_na  Woman  20    160

In [4]:
df.sort_index(axis=0, ascending=False)

      name    sex age height
2    Ha_na  Woman  20    160
1   Han_la    Man  21    117
0  Han_bit    Man  20    180

In [5]:
df.sort_index(axis=1) # 행 기준 오름차순 정렬

  age height     name    sex
0  20    180  Han_bit    Man
1  21    117   Han_la    Man
2  20    160    Ha_na  Woman

In [6]:
df.sort_values(by=['age','height'], ascending=False)

      name    sex age height
1   Han_la    Man  21    117
0  Han_bit    Man  20    180
2    Ha_na  Woman  20    160

In [7]:
# 데이터프레임에서 이름만을 조회하세요
df['name'] #시리즈 표현

0    Han_bit
1     Han_la
2      Ha_na
Name: name, dtype: object

In [8]:
df[['name', 'sex']] #데이터프레임 표현

      name    sex
0  Han_bit    Man
1   Han_la    Man
2    Ha_na  Woman

In [9]:
df.iloc[0:1,0:3] #행 인덱스, 열 인덱스

      name  sex age
0  Han_bit  Man  20

In [10]:
df.iloc[[1,2],[1,2]] #행 인덱스 지정, 열 인덱스 지정

     sex age
1    Man  21
2  Woman  20

In [11]:
df.loc[1, 'name'] #행이름, 열이름 지정하여 조회

'Han_la'

In [20]:
#나이가 20세인 학생을 모두 출력하세요
df[df['age']=='20']

      name    sex age height
0  Han_bit    Man  20    180
2    Ha_na  Woman  20    160

In [19]:
#나이가 20세 이상이거나 키가 170이하인 사람을 모두 출력하세요
df[(df['age']>='20') | (df['height']<'170')]

      name    sex age height
0  Han_bit    Man  20    180
1   Han_la    Man  21    117
2    Ha_na  Woman  20    160

In [21]:
df[df['name'].str.contains('Han')]

      name  sex age height
0  Han_bit  Man  20    180
1   Han_la  Man  21    117

In [25]:
#성별이 남자고 키가 180이상인 사람을 출력하세요
df[(df['sex']=='Man') & (df['height']>='180')]

      name  sex age height
0  Han_bit  Man  20    180

In [26]:
df.describe() #숫자형 데이터 통계확인

           name  sex age height
count         3    3   3      3
unique        3    2   2      3
top     Han_bit  Man  20    180
freq          1    2   2      1

1-1. 다음의 데이터프레임을 생성하세요

과목번호 과목명 강의실 시간수

c1  파이썬응용 201호  4

c2  자료구조 505호 3

c3 인공지능 702호 3

c4 c프로그래임 205호 4

1-2. table1.csv파일로 저장하라 .

1-3. 이를 불러와서 열이름을 조회하라



2. 수업 실습 & 설명 달기

3. 1번 문제에서  오늘 실습내용을 활용한 문제를 3개 이상 실습하세요.상 수행하세요.불러와서 열이름을 조회하라

In [32]:
list2=list([['C1', '파이썬응용', '201호', 4],
            ['C2', '자료구조', '505호', 3],
            ['C3', '인공지능', '702호', 4],
            ['C4', 'C프로그래밍', '205호', 4]
           ])
col_names2=['과목번호','과목명','강의실','시간수']
df2=pd.DataFrame(list2, columns=col_names2)
df2

  과목번호     과목명   강의실  시간수
0   C1   파이썬응용  201호    4
1   C2    자료구조  505호    3
2   C3    인공지능  702호    4
3   C4  C프로그래밍  205호    4

In [38]:
df2.to_csv('./table1.csv', header=True, index=False, encoding='utf-8')

In [40]:
dfR=pd.read_csv('./table1.csv', sep=',')
dfR

  과목번호     과목명   강의실  시간수
0   C1   파이썬응용  201호    4
1   C2    자료구조  505호    3
2   C3    인공지능  702호    4
3   C4  C프로그래밍  205호    4

In [41]:
dfR[dfR['시간수']>3]

  과목번호     과목명   강의실  시간수
0   C1   파이썬응용  201호    4
2   C3    인공지능  702호    4
3   C4  C프로그래밍  205호    4

In [44]:
dfR[dfR['과목명'].str.contains('인')]

  과목번호   과목명   강의실  시간수
2   C3  인공지능  702호    4

In [45]:
dfR.sort_index(axis=0)

  과목번호     과목명   강의실  시간수
0   C1   파이썬응용  201호    4
1   C2    자료구조  505호    3
2   C3    인공지능  702호    4
3   C4  C프로그래밍  205호    4

In [46]:
dfR.sort_index(axis=1)

    강의실     과목명 과목번호  시간수
0  201호   파이썬응용   C1    4
1  505호    자료구조   C2    3
2  702호    인공지능   C3    4
3  205호  C프로그래밍   C4    4

In [47]:
dfR['시간수']+2

0    6
1    5
2    6
3    6
Name: 시간수, dtype: int64